In [1]:
from chalk.client import ChalkClient
from src.models import User, Transaction

In [2]:
client = ChalkClient(branch="main")

In [4]:
ds = client.offline_query(
    input={User.id: [1]},
    output=[User],
    recompute_features=True
)
ds.to_pandas()

,user.id,user.email,user.name,user.dob,user.denylisted,user.name_email_match_score,user.emailage_response,user.email_age_days,user.domain_age_days,user.credit_report_id,user.count_food_purchases__86400__,user.count_food_purchases__604800__,user.count_food_purchases__2592000__
0,1,nicoleam@nasa.gov,Nicole Mann,1977-08-27 00:00:00+00:00,False,0.4375,"{""domainAge"": 10200, ""domainname"": ""nasa.gov"",...",2443,10200,123,0,0,0

In [5]:
ds2 = client.offline_query(
    input={Transaction.id: range(100)},
    output=[Transaction.memo, Transaction.user_id, Transaction.amount],
    recompute_features=True
)
ds2.to_pandas()

,transaction.memo,transaction.user_id,transaction.amount,transaction.id
0,Southwest Airlines 08/12,1.0,-89.22,18
1,ACH TRANSFER 3456789012,1.0,150.00,38
2,Lyft ride 07/27,1.0,-22.45,88
3,Apple TV+,1.0,-7.99,99
4,None,NaN,NaN,52
...,...,...,...,...
95,Starbucks 57892,1.0,-12.45,2
96,Disney+ Subscription,1.0,-19.99,25
97,Spotify Subscription,1.0,-14.99,45
98,ACH TRANSFER 1098765432,1.0,250.00,69
99,None,NaN,NaN,11